# 数据重塑
:label:`dataframe-melt`

pandas.melt()是用于将宽格式（wide format）的数据表格转换为长格式（long format）。这个函数通常用于数据重塑（data reshaping）操作，以便更容易进行数据分析和可视化。

通过这种方式，可以将宽格式数据表格中的多列数据整合到一个列中，可以理解为透视表pivot_table()的反操作。

![数据重塑](../drawio/ch-pandas/melt.drawio)
:width:`800px`
:label:`melt-img`

In [ ]:
import pandas as pd
#create student_df
d1 = {'Student_id':pd.Series([1,2,3]), 'Name':pd.Series(['Amy','Bob','John']), 
'Math':pd.Series([90,78,88]),'English':pd.Series([85,92,79]),
'History':pd.Series([88,76,90])}
student_df = pd.DataFrame(d1)
print("student_df:")
student_df

student_df:

   Student_id  Name  Math  English  History
0           1   Amy    90       85       88
1           2   Bob    78       92       76
2           3  John    88       79       90

In [ ]:
melted_df = pd.melt(student_df, id_vars=['Student_id', 'Name'], value_vars=['Math', 'English', 'History'], 
var_name='Subject', value_name='Score')
print("melted_df")
melted_df

melted_df

   Student_id  Name  Subject  Score
0           1   Amy     Math     90
1           2   Bob     Math     78
2           3  John     Math     88
3           1   Amy  English     85
4           2   Bob  English     92
5           3  John  English     79
6           1   Amy  History     88
7           2   Bob  History     76
8           3  John  History     90

数据重塑时，通常需要使用`value_vars`来指定需要“融化”的列，使它们被整合为一列。比如本例中，将`Math`,`English`,`History`作为`Subject`被整合为一列。

我们回到 `melt` 函数的参数。完整的参数形式为:`pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)`。

`frame`指的是要进行重塑操作的 DataFrame 。

`id_vars`表示需要保留的列，它们将成为长格式中的标识变量（identifier variable），不被"融化"。

`value_vars`是需要"融化"的列，它们将被整合成一列，并用新的列名表示。

`var_name`用于存储"融化"后的列名的新列的名称。

`value_name`用于存储"融化"后的值的新列的名称。

如果输入数据是多级索引（MultiIndex），则可以用`col_level`指定在哪个级别上应用"融化"操作。